Revit 2027 API
PointCloudInstance.GetRegions Method
 Returns array of region names.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetRegions()
Public Function GetRegions As IList(Of String)
public:
IList<String^>^ GetRegions()
member GetRegions : unit -> IList<string>
Return Value
IList<String>
 Resulting array of region names.
See Also
Reference
PointCloudInstance Class
Autodesk.Revit.DB Namespace